#!/bin/bash
#
# Title:      Elastic Enterprise Search DEMO
# Author(s):  Guzmán Monné
# URL:        https://github.com/conatel-i-d/elastic-enterprise-search-demo
# GNU:        Genral Public Licencse v3.0
###############################################################################

primestart() {
  check_dependencies
  varstart
  menuprime
}

check_dependencies(){
  # Check that all dependencies are installed
  for var in openssl ansible ansible-playbook 
  do
    path=$(which $var)
    if [ -z "$path" ]
    then
      tee <<-EOF

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
⚠️  Dependency check: Notice
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
We've not detected a working version of $path. Exiting!
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
EOF
    exit; 
    fi
  done
  tee <<-EOF

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
✅  Dependency check: Notice
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
All dependencies installed
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
EOF
}

varstart(){
  export ANSIBLE_CONFIG=./ansible.cfg
  
  password_file=./password
  if [ !-f $password_file ]; then
    tee <<-EOF

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🔔 Password file check: Notice
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
We've not found a password file. A new one will be created.
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
EOF
    # Create empty password file to avoid error when running the first
    # playbook
    echo tmp > password
    # Create the playbook
    ansible-playbook playbooks/create-password-file.yml
  fi
  tee <<-EOF

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
✅ Variables check: Notice
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
All variables configured.
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
EOF
}

continueprime() {
  tee <<-EOF

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
✅ Done!
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
EOF
  # Standby
  read -p '▶️  Press [ENTER] to continue: '
  menuprime
}

menuprime(){
  clear
  # Menu interface
  tee <<-EOF

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🌎 Elastic Enterprise Search DEMO: What do you want to do?
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

🌵 Select one of the following options:

EOF
  tee <<-EOF
[1] Run DEMO
[2] Stop DEMO
[3] Edit the passwords.yml file

[R] Restart DEMO
[Z] Exit

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
EOF
  # Standby
  read -p '▶️  Type Number | Press [ENTER]: ' typed < /dev/tty

  case $typed in
    1 )
      bash ./scripts/run-demo.sh
      continueprime ;;
    2 )
      bash ./scripts/kill-demo.sh
      continueprime ;;
    3 )
      bash ./scripts/secret.sh
      continueprime ;;
    R )
      bash ./scripts/kill-demo.sh
      bash ./scripts/run-demo.sh
      continueprime ;;
    Z )
      bash ./scripts/ending.sh
      exit ;;
    * )
      menuprime ;;
  esac
}

# Run the script
primestart
